redbear/nRF5x/nRF51822/arduino/arduino-1.6.x/hardware/RBL/RBL_nRF51822/boards.txt
##############################################################

Generic_nRF51822_16KB.name=Generic_nRF51822(16KB)

#Generic_nRF51822_16KB.upload.tool=avrdude
#Generic_nRF51822_16KB.upload.protocol=avr109

Generic_nRF51822_16KB.upload.tool=openocd
Generic_nRF51822_16KB.upload.protocol=
Generic_nRF51822_16KB.upload.maximum_size=262144
Generic_nRF51822_16KB.upload.maximum_data_size=16384
Generic_nRF51822_16KB.upload.speed=115200
Generic_nRF51822_16KB.upload.disable_flushing=false
Generic_nRF51822_16KB.upload.use_1200bps_touch=false
Generic_nRF51822_16KB.upload.wait_for_upload_port=false

Generic_nRF51822_16KB.bootloader.tool=openocd
#Generic_nRF51822_16KB.bootloader.bootloader_file=bootloader.hex

Generic_nRF51822_16KB.menu.lfclk.lfxo=Crystal Oscillator
#Generic_nRF51822_16KB.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF51822_16KB.menu.lfclk.lfxo.bootloader.bootloader_file=bootloader.hex
Generic_nRF51822_16KB.menu.lfclk.lfrc=RC Oscillator
#Generic_nRF51822_16KB.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF51822_16KB.menu.lfclk.lfrc.bootloader.bootloader_file=bootloader_no_xtal.hex

Generic_nRF51822_16KB.build.mcu=cortex-m0
Generic_nRF51822_16KB.build.f_cpu=16000000
Generic_nRF51822_16KB.build.usb_product="Arduino RBL"
Generic_nRF51822_16KB.build.board=RBL_nRF51822
Generic_nRF51822_16KB.build.core=RBL_nRF51822
Generic_nRF51822_16KB.build.variant=BLE_Nano
Generic_nRF51822_16KB.build.extra_flags=-mthumb
Generic_nRF51822_16KB.build.ldscript=linker_scripts/gcc/RBL_nRF51822.ld
Generic_nRF51822_16KB.build.ble_api_include="-I{runtime.platform.path}/cores/RBL_nRF51822/ble-master" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-master/ble/services" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-master/source" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-master/source/services"
Generic_nRF51822_16KB.build.nRF51822_api_include="-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/btle" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/btle/custom" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/common" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_radio_notification" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_services/ble_dfu" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/common" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager/config" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/peer_manager" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/device" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/ble_flash" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/delay" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/hal" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage/config" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu/hci_transport" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/crc16" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/experimental_section_vars" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/fds" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/fstorage" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/hci" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/scheduler" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/timer" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/util" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/softdevice/common/softdevice_handler" "-I{runtime.platform.path}/cores/RBL_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/softdevice/s130/headers"
Generic_nRF51822_16KB.build.mbed_api_include="-I{runtime.platform.path}/cores/RBL_nRF51822/mbed/api" "-I{runtime.platform.path}/cores/RBL_nRF51822/mbed/common" "-I{runtime.platform.path}/cores/RBL_nRF51822/mbed/hal" "-I{runtime.platform.path}/cores/RBL_nRF51822/mbed/targets/cmsis" "-I{runtime.platform.path}/cores/RBL_nRF51822/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/" "-I{runtime.platform.path}/cores/RBL_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822" "-I{runtime.platform.path}/cores/RBL_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/TARGET_RBLAB_NRF51822"

##############################################################

Generic_nRF51822_32KB.name=Generic_nRF51822(32KB)

#Generic_nRF51822_32KB.upload.tool=avrdude
#Generic_nRF51822_32KB.upload.protocol=avr109

Generic_nRF51822_32KB.upload.tool=openocd
Generic_nRF51822_32KB.upload.protocol=
Generic_nRF51822_32KB.upload.maximum_size=262144
Generic_nRF51822_32KB.upload.maximum_data_size=32768
Generic_nRF51822_32KB.upload.speed=115200
Generic_nRF51822_32KB.upload.disable_flushing=false
Generic_nRF51822_32KB.upload.use_1200bps_touch=false
Generic_nRF51822_32KB.upload.wait_for_upload_port=false

Generic_nRF51822_32KB.bootloader.tool=openocd
#Generic_nRF51822_32KB.bootloader.bootloader_file=bootloader.hex

